Revit 2027 API
FailureHandlingOptions.GetClearAfterRollback Method
 Obtains the flag indicating if all posted failures should be removed silently when transaction is being rolled back.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool GetClearAfterRollback()
Public Function GetClearAfterRollback As Boolean
public:
bool GetClearAfterRollback()
member GetClearAfterRollback : unit -> bool
Return Value
Boolean
 True to clear posted failures silently if the transaction is being rolled back, false to keep these failures in place (they may be displayed to the user).
See Also
Reference
FailureHandlingOptions Class
Autodesk.Revit.DB Namespace